app/views/authors/_form.html.erb

SELECT "books".* FROM "books"
---
    <h5 class="card-title">Book id:</h5>
      <%= form.collection_select(:book_ids, Book.all, :id, :title,{:"data-style" => "chosen-select", :"data-size" => "5"}, {class: "selectpicker", title: "Choose Book(s)", multiple: true})%>