app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
      <h5 class="card-title">Author id:</h5>
      <p class="card-text"><%= form.collection_check_boxes :author_ids, Author.all, :id, :full_name, { hide_label: true } %></p>