app/controllers/authors_controller.rb

  def create
    @author = Author.new(params.require(:author).permit(:first_name, :last_name, :dob, :bookid, book_ids: []))

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "dob", "bookid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Author  1"], ["last_name", "last name 1"], ["dob", "2022-11-24"], ["bookid", ""], ["created_at", "2022-11-24 07:59:45.562237"], ["updated_at", "2022-11-24 07:59:45.562237"]]