app/controllers/books_controller.rb

  def create
    @book = Book.new(params.require(:book).permit(:title,:description, author_ids: []))

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Book 1"], ["description", "This is first book"], ["created_at", "2022-11-24 07:59:20.026542"], ["updated_at", "2022-11-24 07:59:20.026542"]]